; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v2 - type_3 ?v5 - type_2)
 	      (pred_4 ?v8 - object ?v5 - type_2)
	      (pred_2 ?v2 - type_3 ?v6 - type_1)
	      (pred_1 ?v2 - type_3 ?v8 - object ?v6 - type_1))

   (:action op_2
       :parameters  (?v2 - type_3 ?v7 ?v1 - type_2)
       :precondition (and  (pred_3 ?v2 ?v7))
       :effect (and  (pred_3 ?v2 ?v1)
		     (not (pred_3 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_3 ?v4 - object ?v3 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v3) (pred_3 ?v2 ?v3) (pred_2 ?v2 ?v6))
       :effect (and (pred_1 ?v2 ?v4 ?v6)
		    (not (pred_4 ?v4 ?v3)) 
		    (not (pred_2 ?v2 ?v6))))

   (:action op_3
       :parameters (?v2 - type_3 ?v4 - object ?v3 - type_2 ?v6 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v4 ?v6) (pred_3 ?v2 ?v3))
       :effect (and (pred_4 ?v4 ?v3)
		    (pred_2 ?v2 ?v6)
		    (not (pred_1 ?v2 ?v4 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_01 obj_11 - type_3
obj_09 obj_10 obj_06 obj_03 - type_1
obj_12 obj_05 obj_07 - type_2
obj_08 obj_04 obj_02 - object)
(:init
(pred_3 obj_01 obj_12)
(pred_2 obj_01 obj_09)
(pred_2 obj_01 obj_10)
(pred_3 obj_11 obj_12)
(pred_2 obj_11 obj_06)
(pred_2 obj_11 obj_03)
(pred_4 obj_08 obj_12)
(pred_4 obj_04 obj_07)
(pred_4 obj_02 obj_05)
)
(:goal
(and
(pred_4 obj_08 obj_05)
(pred_4 obj_04 obj_05)
(pred_4 obj_02 obj_05)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_07)))
)
)

; plan
1. (op_1 obj_01 obj_08 obj_12 obj_10)
   deleted: (pred_4 obj_08 obj_12) (pred_2 obj_01 obj_10)
   added: (pred_1 obj_01 obj_08 obj_10)
   goals met: 1 of 3
2. (op_2 obj_11 obj_12 obj_07)
   deleted: (pred_3 obj_11 obj_12)
   added: (pred_3 obj_11 obj_07)
   goals met: 1 of 3
3. (op_2 obj_01 obj_12 obj_05)
   deleted: (pred_3 obj_01 obj_12)
   added: (pred_3 obj_01 obj_05)
   goals met: 1 of 3
4. (op_1 obj_11 obj_04 obj_07 obj_03)
   deleted: (pred_4 obj_04 obj_07) (pred_2 obj_11 obj_03)
   added: (pred_1 obj_11 obj_04 obj_03)
   goals met: 1 of 3
5. (op_2 obj_11 obj_07 obj_05)
   deleted: (pred_3 obj_11 obj_07)
   added: (pred_3 obj_11 obj_05)
   goals met: 1 of 3
6. (op_3 obj_01 obj_08 obj_05 obj_10)
   deleted: (pred_1 obj_01 obj_08 obj_10)
   added: (pred_4 obj_08 obj_05) (pred_2 obj_01 obj_10)
   goals met: 2 of 3
7. (op_3 obj_11 obj_04 obj_05 obj_03)
   deleted: (pred_1 obj_11 obj_04 obj_03)
   added: (pred_4 obj_04 obj_05) (pred_2 obj_11 obj_03)
   goals met: 3 of 3
